Revit 2027 API
BalusterPlacement.UseBalusterPerTreadOnStairs Property
 If true, one or more balusters will be included on each tread of an associated stair. If false, this is not guaranteed to happen.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseBalusterPerTreadOnStairs { get; set; }
Public Property UseBalusterPerTreadOnStairs As Boolean
	Get
	Set
public:
property bool UseBalusterPerTreadOnStairs {
	bool get ();
	void set (bool value);
}
member UseBalusterPerTreadOnStairs : bool with get, set
Property Value
Boolean
See Also
Reference
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace